In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.2/11.5 MB 6.9 MB/s eta 0:00:02
   -- ------------------------------------- 0.7/11.5 MB 9.1 MB/s eta 0:00:02
   ---- ----------------------------------- 1.3/11.5 MB 10.4 MB/s eta 0:00:01
   ------- -------------------------------- 2.2/11.5 MB 12.6 MB/s eta 0:00:01
   ---------- ----------------------------- 3.0/11.5 MB 13.7 MB/s eta 0:00:01
   -------------- ------------------------- 4.2/11.5 MB 15.7 MB/s eta 0:00:01
   -------------------- ------------------- 5.9/11.5 MB 18.7 MB/s eta 0:00:01
   -------------------------- ------------- 7.7/11.5 MB 21.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.6/11.5 MB 23.6 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 31.2 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 28.5 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   ---------------------------------------- 505.5/505.5 kB ? eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   --------------------------------------- 345.4/345.4 kB 20.9 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [3]:
obj = ['이유리', '최민준', '김민지']

In [4]:
pd.Series(obj)

0    이유리
1    최민준
2    김민지
dtype: object

In [5]:
idx = ['a', 'b', 'c']

In [6]:
pd.Series(obj, index = idx)

a    이유리
b    최민준
c    김민지
dtype: object

In [12]:
obj = {'A' : '이유리', 'B' : '최민준', 'C' : '김민지'}

In [13]:
pd.Series(obj)

A    이유리
B    최민준
C    김민지
dtype: object

In [23]:
# 데이터프레임

obj1 = {
    "이름" : ["이유리", "최민준", "김민지"],
    "전공" : ["경영학과", "컴퓨터공학과", "데이터공학과"],
    "성별" : ["여", "남", "여"],
    "나이" : [20, 22, 21]
}

df_1 = pd.DataFrame(obj1)
print(df_1)
print(type(df_1))

    이름      전공 성별  나이
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터공학과  여  21
<class 'pandas.core.frame.DataFrame'>

In [19]:
import numpy as np

In [24]:
obj2 = np.array([
    ["이유리", "경영학과", "여자", 20],
    ["최민준", "컴퓨터공학과", "남자", 22],
    ["김민지", "테이터과학과", "여자", 21]
])

df_2 = pd.DataFrame(obj2)
print(df_2)

     0       1   2   3
0  이유리    경영학과  여자  20
1  최민준  컴퓨터공학과  남자  22
2  김민지  테이터과학과  여자  21

In [29]:
df_3 = pd.DataFrame(
                    obj2,
                    columns = ["Name", "Major", "Sex", "Age"],
                    index = ["A", "B", "C"]
                    )
df_3

  Name   Major Sex Age
A  이유리    경영학과  여자  20
B  최민준  컴퓨터공학과  남자  22
C  김민지  테이터과학과  여자  21

In [32]:
obj = {
    "Name" : ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Male"],
    "Age" : [22, 32, 27, 18, 38, 19]
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [36]:
a = df.values
print(a)
print("~" * 112)
print(type(a))

[['Olivia' 'Female' 22]
 ['Lucas' 'Male' 32]
 ['Sophia' 'Female' 27]
 ['Zoe' 'Female' 18]
 ['Ava' 'Female' 38]
 ['Elliot' 'Male' 19]]
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
<class 'numpy.ndarray'>

In [37]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [38]:
df.columns

Index(['Name', 'Sex', 'Age'], dtype='object')

In [39]:
df.dtypes

Name    object
Sex     object
Age      int64
dtype: object

In [40]:
df.shape

(6, 3)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Sex     6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [48]:
df.head()

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38

In [50]:
df.head(1)

     Name     Sex  Age
0  Olivia  Female   22

In [51]:
df.head(-3)

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27

In [52]:
df.tail()

     Name     Sex  Age
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [53]:
df.tail(1)

     Name   Sex  Age
5  Elliot  Male   19

In [54]:
df.tail(-3)

     Name     Sex  Age
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    Male   19

In [58]:
obj = {
    "Name" : ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Male"],
    "Age" : [22, 32, 27, 18, 38, 19]
}

idx = list("abcdef") # --> ["a", "b", ... "f"]
df = pd.DataFrame(obj, index = idx)
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [62]:
print(df["Name"])

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [63]:
df.Name

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [64]:
df[["Name", "Age"]]

     Name  Age
a  Olivia   22
b   Lucas   32
c  Sophia   27
d     Zoe   18
e     Ava   38
f  Elliot   19

In [65]:
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [66]:
df.iloc[0]

Name    Olivia
Sex     Female
Age         22
Name: a, dtype: object

In [67]:
df.iloc[1]

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [69]:
df.iloc[1:5]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [70]:
df.iloc[[1, 3, 5]]

     Name     Sex  Age
b   Lucas    Male   32
d     Zoe  Female   18
f  Elliot    Male   19

In [71]:
df.loc["b"]

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [73]:
df.loc["b":"e"]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [76]:
df.loc[["a", "c", "e"]]

     Name     Sex  Age
a  Olivia  Female   22
c  Sophia  Female   27
e     Ava  Female   38

In [77]:
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [85]:
# print(df["Age"][0])
print(df["Age"]["a"])

22

In [89]:
print(df.loc["a"]["Age"])

22

In [90]:
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [99]:
df.iloc[1:4, 1:3]

      Sex  Age
b    Male   32
c  Female   27
d  Female   18

In [100]:
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    Male   19

In [104]:
df.loc["b", "Name"]

'Lucas'

In [112]:
rownm = ["b", "d", "e"]
colunm = ["Name", "Sex"]

# df.loc[["b", "d", "e"],["Name", "Sex"]]

df.loc[rownm, colunm]

    Name     Sex
b  Lucas    Male
d    Zoe  Female
e    Ava  Female

In [114]:
obj = {
    "Name" : ["Olivia", "Lucas", "Sophia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Male"],
    "Age" : [22, 32, 27, 18, 38, 19],
    "Score" : [100, 95, 60, 77, 83, 84],
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age  Score
0  Olivia  Female   22    100
1   Lucas    Male   32     95
2  Sophia  Female   27     60
3     Zoe  Female   18     77
4     Ava  Female   38     83
5  Elliot    Male   19     84

In [115]:
df.describe()

             Age       Score
count   6.000000    6.000000
mean   26.000000   83.166667
std     7.874008   14.133884
min    18.000000   60.000000
25%    19.750000   78.500000
50%    24.500000   83.500000
75%    30.750000   92.250000
max    38.000000  100.000000

In [1]:
import pandas as pd